cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'

# ---- Brew ---- #

# SCM
brew 'git-flow'
brew 'tig'

# iOS
brew 'carthage'
brew 'liftoff'
brew 'natalie'

# Misc Utils
brew 'wget'
brew 'youtube-dl'

brew 'argon/mas/mas'

# ----- Casks ----- #

# Password management
cask '1password'

# Text Editors/IDEs
cask 'atom'
cask 'sublime-text'
cask 'coderunner'

# Browsers
cask 'google-chrome'

# Messaging
cask 'slack'
cask 'goofy'
cask 'chitchat'
cask 'skype'

# Gaming
cask 'steam'

# Coding aid
cask 'charles'
cask 'reflector'
cask 'cyberduck'
cask 'dash'
cask 'zeplin'

# Misc
cask 'vlc'
cask 'receitanet'

