cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'thoughtbot/formulae'
tap 'argon/mas'

# ---- Brew ---- #

# SCM
brew 'git-flow'
brew 'tig'

# iOS
brew 'carthage'
brew 'liftoff'
brew 'natalie'

# Misc Utils
brew 'wget'
brew 'youtube-dl'
brew 'trash'

brew 'argon/mas/mas'
brew 'imagemagick'

brew 'npm'

# ----- Casks ----- #

# Password and licence management
cask 'dropbox'
cask '1password'

# Text Editors/IDEs
cask 'sublime-text'
cask 'coderunner'
cask 'visual-studio-code'

# Browsers
cask 'google-chrome'

# Messaging
cask 'slack'
cask 'whatsapp'
cask 'skype'

# Gaming
cask 'steam'

# Coding aid
cask 'charles'
cask 'reflector'
cask 'cyberduck'
cask 'dash'
cask 'zeplin'
cask 'paw'
cask 'asset-catalog-tinkerer'

# Productivity

cask 'alfred'
cask 'shortcat'
cask 'karabiner-elements'

# Misc
cask 'vlc'
cask 'flux'
